In [8]:
import pandas as pd

# First I'll read the data and check for errors/missing data/typo's/datatypes everything for data cleaning.

In [9]:
df = pd.read_excel("example_data_cleaning.xlsx")
df

,TransactionID,ClientID,BirthYear,Amount,Profession,Department,Risk
0,4,34985,1923.000000,5670,manager,78,Low
1,16,34997,1923.000000,2399090,developer,78,High
2,25,35006,1923.000000,33050,HR,78,High
3,12,34993,1939.142857,23430,professor,78,Low
4,21,35002,1939.142857,16770,manager,78,Low
5,11,34992,1943.857143,21210,researcher,78,Medium
6,20,35001,1943.857143,14550,student,78,Medium
7,3,34984,1945.000000,3450,student,78,Medium
8,19,35000,1948.571429,12330,barmen,78,High
9,9,34990,1953.285714,16770,Manager,78,Medium
10,8,34989,1958.000000,14550,HR,78,High
11,6,34987,1967.000000,10110,Manager,78,Medium
12,15,34987,1967.000000,30090,Manager,78,Low
13,24,34989,1967.000000,27870,HR,78,Medium
14,27,35008,1967.000000,41930,bdm,78,Low
15,28,35008,1967.000000,46370,NaN,78,High
16,29,35008,1976.000000,50810,NaN,78,Medium
17,5,34986,1978.000000,7890,hr,78,High
18,17,34998,1978.000000,7890,etudient,78,Medium
19,10,34991,1988.000000,18990,BDM,78,Low
20,30,34991,1988.000000,55250,BDM,78,High
21,18,34999,1988.000000,10110,etudient,78,Low
22,23,34988,1999.000000,25650,Manager,78,Low
23,14,34995,1999.000000,27870,Hairdresser,78,Low
24,26,35007,1999.000000,37490,etudient,78,Medium
25,1,34982,2013.000000,12900,Student,78,Low
26,2,34983,2015.000000,1230,barmen,78,High
27,13,34994,2017.000000,25650,Driver,78,Medium
28,22,34987,NaN,18990,sailer,78,High
29,7,34988,NaN,12330,Manager,78,Medium

# I can see there are some typo's in Profession. Some datatype errors in BirthYear for example. I will fix those and also check how many NAN's in the dataframe.

In [10]:
null_columns = df.isnull().sum()
null_columns

TransactionID    0
ClientID         0
BirthYear        2
Amount           0
Profession       2
Department       0
Risk             0
dtype: int64

# There are only 2 NAN's I will fill them.

In [11]:
df['BirthYear']= df['BirthYear'].fillna(0)
df['BirthYear'] = df['BirthYear'].astype('int64')
df

,TransactionID,ClientID,BirthYear,Amount,Profession,Department,Risk
0,4,34985,1923,5670,manager,78,Low
1,16,34997,1923,2399090,developer,78,High
2,25,35006,1923,33050,HR,78,High
3,12,34993,1939,23430,professor,78,Low
4,21,35002,1939,16770,manager,78,Low
5,11,34992,1943,21210,researcher,78,Medium
6,20,35001,1943,14550,student,78,Medium
7,3,34984,1945,3450,student,78,Medium
8,19,35000,1948,12330,barmen,78,High
9,9,34990,1953,16770,Manager,78,Medium
10,8,34989,1958,14550,HR,78,High
11,6,34987,1967,10110,Manager,78,Medium
12,15,34987,1967,30090,Manager,78,Low
13,24,34989,1967,27870,HR,78,Medium
14,27,35008,1967,41930,bdm,78,Low
15,28,35008,1967,46370,NaN,78,High
16,29,35008,1976,50810,NaN,78,Medium
17,5,34986,1978,7890,hr,78,High
18,17,34998,1978,7890,etudient,78,Medium
19,10,34991,1988,18990,BDM,78,Low
20,30,34991,1988,55250,BDM,78,High
21,18,34999,1988,10110,etudient,78,Low
22,23,34988,1999,25650,Manager,78,Low
23,14,34995,1999,27870,Hairdresser,78,Low
24,26,35007,1999,37490,etudient,78,Medium
25,1,34982,2013,12900,Student,78,Low
26,2,34983,2015,1230,barmen,78,High
27,13,34994,2017,25650,Driver,78,Medium
28,22,34987,0,18990,sailer,78,High
29,7,34988,0,12330,Manager,78,Medium

In [12]:
df['Profession']= df['Profession'].fillna("Not Specified")
df

,TransactionID,ClientID,BirthYear,Amount,Profession,Department,Risk
0,4,34985,1923,5670,manager,78,Low
1,16,34997,1923,2399090,developer,78,High
2,25,35006,1923,33050,HR,78,High
3,12,34993,1939,23430,professor,78,Low
4,21,35002,1939,16770,manager,78,Low
5,11,34992,1943,21210,researcher,78,Medium
6,20,35001,1943,14550,student,78,Medium
7,3,34984,1945,3450,student,78,Medium
8,19,35000,1948,12330,barmen,78,High
9,9,34990,1953,16770,Manager,78,Medium
10,8,34989,1958,14550,HR,78,High
11,6,34987,1967,10110,Manager,78,Medium
12,15,34987,1967,30090,Manager,78,Low
13,24,34989,1967,27870,HR,78,Medium
14,27,35008,1967,41930,bdm,78,Low
15,28,35008,1967,46370,Not Specified,78,High
16,29,35008,1976,50810,Not Specified,78,Medium
17,5,34986,1978,7890,hr,78,High
18,17,34998,1978,7890,etudient,78,Medium
19,10,34991,1988,18990,BDM,78,Low
20,30,34991,1988,55250,BDM,78,High
21,18,34999,1988,10110,etudient,78,Low
22,23,34988,1999,25650,Manager,78,Low
23,14,34995,1999,27870,Hairdresser,78,Low
24,26,35007,1999,37490,etudient,78,Medium
25,1,34982,2013,12900,Student,78,Low
26,2,34983,2015,1230,barmen,78,High
27,13,34994,2017,25650,Driver,78,Medium
28,22,34987,0,18990,sailer,78,High
29,7,34988,0,12330,Manager,78,Medium

# Fixing some typo's.

In [13]:
df['Profession'] = df['Profession'].str.replace('etudient', 'Student')

# Capitalize the values in the profession column.
df['Profession'] = df['Profession'].str.capitalize()
df.head()

   TransactionID  ClientID  BirthYear   Amount Profession  Department  Risk
0              4     34985       1923     5670    Manager          78   Low
1             16     34997       1923  2399090  Developer          78  High
2             25     35006       1923    33050         Hr          78  High
3             12     34993       1939    23430  Professor          78   Low
4             21     35002       1939    16770    Manager          78   Low

In [14]:
len(df)

30

# Dropping duplicates

In [15]:
# Removing duplicates
df = df.drop_duplicates()
len(df)
# No duplicates found.

30

# Encoding

In [28]:
df.head()

   TransactionID  ClientID  BirthYear   Amount  Profession  Department  Risk
0              4     34985       1923     5670           6          78     1
1             16     34997       1923  2399090           2          78     0
2             25     35006       1923    33050           5          78     0
3             12     34993       1939    23430           8          78     1
4             21     35002       1939    16770           6          78     1

In [30]:
# Categorical boolean mask
categorical_feature_mask = df.dtypes==object
# Filtering categorical columns by using mask
categorical_cols = df.columns[categorical_feature_mask].tolist()

In [26]:
# Importing LabelEncoder
from sklearn.preprocessing import LabelEncoder
# Instance of the labelencoder.
le = LabelEncoder()

In [27]:
# apply le on categorical feature columns
df[categorical_cols] = df[categorical_cols].apply(lambda col: le.fit_transform(col))
df[categorical_cols].head(10)

   Profession  Risk
0           6     1
1           2     0
2           5     0
3           8     1
4           6     1
5           9     2
6          11     2
7          11     2
8           0     0
9           6     2